

/**
 * Task #5
 * description : Напишите программу Java для вычисления указанной формулы.
 */
public class Formula {
  public static void main(String[] args) {
    System.out.println(4 * (1 - (1/3) + (1/5) - (1/7) + (1/9) - (1/11)));
  }
}